var quotes = [
    ["Царь Соломон", "http://www.adme.ru/svoboda-kultura/20-mudryh-myslej-carya-solomona-o-zhizni-886910/",
        "Всему свой час и время всякому делу под небесами: время родиться и время умирать. Время разрушать и время строить. Время разбрасывать камни и время складывать камни. Время молчать и время говорить.",
        "И глупец, когда молчит, может показаться мудрым.",
        "Обещал — исполни! Лучше не обещать, чем обещать и не исполнять.",
        "Вдвоем быть лучше, чем одному, ибо, если упадут, друг друга поднимут, но горе, если один упадет, а, чтоб поднять его, нет другого, да и если двое лежат — тепло им, одному же как согреться.",
        "Мудрая жена устраивает дом свой, а глупая разрушает его своими руками.",
        "Кто роет яму, тот упадет в нее, и кто покатит вверх камень, к тому он воротится.",
        "Я увидел: нет большего блага, чем радоваться своим делам, ибо в этом и доля человека, — ибо кто его приведет посмотреть, что будет после.",
        "Нет человека, властного над ветром, — и над смертным часом нет власти, и отпуска нет на войне, и не выручит нечестие нечестивца.",
        "Кто хранит уста свои — тот бережет душу свою, а кто широко растворяет рот — тому беда.",
        "Долготерпеливый лучше храброго, и владеющий собою лучше завоевателя города.",
        "Не поможет богатство в день гнева, правда же спасет от смерти.",
        "Что золотое кольцо в носу у свиньи, то женщина красивая и безрассудная.",
        "Благоразумный видит беду и укрывается, а неопытные идут вперед и наказываются.",
        "Главное — мудрость: приобретай мудрость и всем имением твоим приобретай разум.",
        "Жесток гнев, неукротима ярость; но кто устоит против ревности.",
        "Кто находится между живыми, тому есть еще надежда.",
        "Ненависть возбуждает раздоры, но любовь покрывает все грехи.",
        "Полезнее мудрость, чем глупость, как полезнее свет, чем тьма. Но единая участь постигнет и мудрого, и глупого.",
        "И при смехе иногда болит сердце, и концом радости бывает печаль.",
        "Придет гордость, придет и посрамление; но со смиренными мудрость."
    ],

    ["Конфуций", "http://www.adme.ru/svoboda-kultura/10-mudrejshih-citat-konfuciya-858410/",
        "Неважно, как медленно вы идете, до тех пор, пока вы не остановитесь.",
        "Никогда не заводите дружбу с человеком, который не лучше вас самих.",
        "Когда ты разгневан, думай о последствиях.",
        "Если очевидно, что цели не могут быть достигнуты, не корректируйте цели, корректируйте действия.",
        "Если ты ненавидишь — значит, тебя победили.",
        "Благородный человек предъявляет требования к себе, низкий человек предъявляет требования к другим.",
        "Чем бы вы ни занимались в жизни, делайте это всем своим сердцем.",
        "Давай наставления только тому, кто ищет знаний, обнаружив свое невежество.",
        "Несдержанность в мелочах погубит великое дело.",
        "Если тебе плюют в спину, значит, ты впереди.."
    ],

    ["Далай Лама", "http://www.adme.ru/svoboda-kultura/15-urokov-zhizni-ot-dalaj-lamy-858760/",
        "Будьте добрее, когда это возможно. А это возможно всегда.",
        "Процветание приходит благодаря действиям, а не благодаря молитвам.",
        "Высокомерие никогда не оправданно. Оно происходит из низкой самооценки или временных, поверхностных достижений.",
        "Когда человеку кажется, что все идет наперекосяк, в его жизнь пытается войти нечто чудесное.",
        "Люди были созданы для того, чтобы их любили, а вещи были созданы для того, чтобы ими пользовались. Мир в хаосе потому, что все наоборот.",
        "Тема сострадания вовсе не имеет отношения к религии. Это общечеловеческое дело, единое условие выживания человеческой расы.",
        "Если можешь помочь, помоги. Если нет, хотя бы не вреди.",
        "Я не отмечаю дни рождения. Для меня этот день ничем не отличается от других. В некотором роде каждый день — день рождения. Вы просыпаетесь утром, все свежо и ново, и главное, чтобы этот новый день принес вам что-то важное.",
        "Цель нашей жизни — стать счастливыми.",
        "Сохраняя положительное отношение к жизни, можно быть счастливым даже в самых неблагоприятных условиях.",
        "Наши враги дают нам прекрасную возможность практиковать терпение, стойкость и сострадание.",
        "Я считаю, что действительно настоящая религия — это доброе сердце.",
        "Мы должны властвовать над технологиями, а не становиться их рабами.",
        "Великие перемены начинаются с отдельных людей; в основе мира во всем мире лежат внутреннее спокойствие и мир в сердце каждого отдельного человека. Каждый из нас может внести свой вклад.",
        "Каждый из нас несет ответственность за все человечество. В этом заключается моя простая религия. Нет нужды в храмах, нет нужды в сложной философии. Наш собственный мозг, наше сердце — вот наш храм; наша философия — доброта."
    ],

    ["Фридрих Ницше", "http://www.adme.ru/tvorchestvo-pisateli/30-genialnyh-citat-mihaila-zhvaneckogo-867060/ © AdMe.ru",
        "Бог умер: теперь мы хотим, чтобы жил сверхчеловек.",
        "Кто сражается с чудовищами, тому следует остерегаться, чтобы самому при этом не стать чудовищем. И если ты долго смотришь в бездну, то бездна тоже смотрит в тебя.",
        "Если вы решили действовать — закройте двери для сомнений.",
        "И если у тебя нет больше ни одной лестницы, ты должен научиться взбираться на собственную голову: как же иначе хотел бы ты подняться выше.",
        "Смерть достаточно близка, чтобы можно было не страшиться жизни.",
        "Много говорить о себе — тоже способ себя скрывать.",
        "Величайшие события — это не наши самые шумные, а наши самые тихие часы.",
        "То, что делается ради любви, происходит вне сферы добра и зла.",
        "Есть два пути избавить вас от страдания: быстрая смерть и продолжительная любовь.",
        "Чем свободнее и сильнее индивидуум, тем взыскательнее становится его любовь.",
        "Не через взаимную любовь прекращается несчастье неразделенной любви, но через большую любовь.",
        "Женщина — вторая ошибка Бога.",
        "Идешь к женщине — бери плетку.",
        "Двух вещей хочет настоящий мужчина: опасности и игры. И потому он ищет женщину, как самую опасную игрушку.",
        "Счастье мужчины называется: я хочу. Счастье женщины называется: он хочет.",
        "«Возлюби ближнего своего» — это значит прежде всего: «Оставь ближнего своего в покое!» — И как раз эта деталь добродетели связана с наибольшими трудностями.",
        "Даже у Бога есть свой ад — это любовь его к людям.",
        "Кто хочет оправдать существование, тому надобно еще и уметь быть адвокатом Бога перед дьяволом.",
        "Есть степень заядлой лживости, которую называют «чистой совестью».",
        "Что хорошо? Все, что повышает чувство власти, волю к власти, власть в человеке. Что дурно? Все, что происходит из слабости.",
        "Что падает, то нужно ещё толкнуть.",
        "С человеком происходит то же, что и с деревом. Чем больше стремится он вверх, к свету, тем глубже впиваются корни его в землю, вниз, в мрак и глубину, — ко злу.",
        "Человек — это канат, натянутый между животным и сверхчеловеком, — канат над пропастью. В человеке ценно то, что он мост, а не цель.",
        "Стыдиться своей безнравственности — это первая ступень лестницы, на вершине которой будешь стыдиться своей нравственности."
    ],

    ["Габриель Гарсиа Маркес", "http://www.adme.ru/vdohnovenie-919705/ego-sto-let-odinochestva-zakonchilis-670955/ © AdMe.ru",
        "Не дай себе умереть, не испытав этого чуда — спать с тем, кого любишь.",
        "Людям, которых любят, следовало бы умирать вместе со всеми их вещами.",
        "Всякая вещь — живая. Надо только суметь разбудить ее душу.",
        "Если вы встретите свою настоящую любовь, то она от вас никуда не денется — ни через неделю, ни через месяц, ни через год.",
        "Если во что-то вовлечена женщина, я знаю, что все будет хорошо. Мне совершенно ясно, что женщины правят миром.",
        "За обеденным столом можно любить так же, как в постели.",
        "Улыбайся, не доставляй беде удовольствия.",
        "В семейной жизни куда легче уклониться от катастроф, нежели от досадных мелочных пустяков.",
        "Ответь ему «да». Даже если умираешь от страха, даже если потом раскаешься, потому что будешь каяться всю жизнь, если сейчас ответишь ему «нет».",
        "Потому что существуют приказы, которые можно отдавать, но выполнять их преступно.",
        "Минута примирения стоит больше закадычной дружбы.",
        "Я всегда говорил и никогда не откажусь от своих слов, что самые интересные люди живут в России.",
        "СССР — это 22 400 000 квадратных километров без единой рекламы кока-колы.",
        "Человек не рождается раз и навсегда в тот день, когда мать производит его на свет, жизнь заставляет его снова и снова — много раз — родиться заново самому.",
        "Нет лекарства, которое способно вылечить то, что может вылечить счастье.",
        "Кто ждет долго, может подождать еще немного.",
        "Я не ношу шляпы, чтобы ни перед кем её не снимать.",
        "Ни один безумец не безумен, если вслушаться в его доводы.",
        "Зачем тратить столько слов, чтобы объяснить то, что чувствует человек на войне, если достаточно одного слова — страх.",
        "Нас окружают необыкновенные, фантастические вещи, а писатели упорно рассказывают нам о маловажных, повседневных событиях.",
        "Дивное свойство — способность думать о прошлых радостях без горечи и раскаяния.",
        "Вдохновение приходит только во время работы.",
        "Знание и мудрость приходят к нам тогда, когда они уже не нужны.",
        "Нет, я не богач. Я бедняк с деньгами, а это не одно и то же.",
        "Будь спокоен. Умереть труднее, чем кажется."
    ],

    ["Братья Стругацкие","http://fit4brain.com/7488",
        "83% всех дней в году начинаются одинаково: звенит будильник.",
        "Целыми неделями тратишь душу на пошлую болтовню, а когда встречаешь настоящего человека, поговорить нет времени.",
        "Детей бить нельзя. Их и без тебя будут всю жизнь колотить кому не лень, а если тебе хочется его ударить, дай лучше по морде самому себе, это будет полезней.",
        "Все правильно: деньги нужны человеку для того, чтобы никогда о них не думать.",
        "Мухи-то воображают, что они летят, когда бьются в стекло. А я воображаю, что я иду. Только потому, что передвигаю ногами.",
        "Просто удивительно, как быстро проходят волны восторга. Грызть себя, уязвлять себя, нудить и зудеть можно часами и сутками, а восторг приходит и тут же уходит.",
        "Если во имя идеала человеку приходится делать подлости, то цена этому идеалу — дерьмо.",
        "Волчица говорит своим волчатам: «Кусайте, как я», и этого достаточно, и зайчиха учит зайчат: «Удирайте, как я», и этого тоже достаточно, но человек-то учит детеныша: «Думай, как я», а это уже преступление.",
        "Почему не помолчать, когда все ясно без слов?",
        "Лучше двадцать раз ошибиться в человеке, чем относиться с подозрением к каждому.",
        "А какой смысл покупать машину, чтобы разъезжать по асфальту? Там, где асфальт, ничего интересного, а где интересно, там нет асфальта.",
        "Фантазия — бесценная вещь, но нельзя ей давать дорогу внутрь. Только вовне, только вовне.",
        "Скептицизм и цинизм в жизни стоят дешево, потому что это много легче и скучнее, нежели удивляться и радоваться жизни.",
        "Среди них никто точно не знал, что такое счастье и в чём именно смысл жизни. И они приняли рабочую гипотезу, что счастье — в непрерывном познании неизвестного, и смысл жизни в том же.",
        "Что это такое — нужен? Это когда нельзя обойтись без. Это когда все время думаешь о. Это когда всю жизнь стремишься к.",
        "Это что-то вроде демократических выборов: большинство всегда за сволочь.",
        "Какой смысл говорить о будущем? О будущем не говорят, его делают!",
        "Там, где торжествует серость, к власти всегда приходят чёрные.",
        "Но ведь не может быть так, чтобы среди тысячи дорог не нашлось верной!",
        "Не в громе космической катастрофы, не в пламени атомной войны и даже не в тисках перенаселения, а в сытой, спокойной тишине кончается история человечества.",
        "Нет на свете ничего такого, чего нельзя было бы исправить.",
        "Не каждому дано быть добрым. Это такой же талант, как музыкальный слух или ясновидение, только более редкий.",
        "Счастье — это когда ты хочешь то, что можешь, и можешь то, что хочешь.",
        "Иногда я спрашиваю себя: какого черта мы так крутимся? Чтобы заработать деньги? Но на кой черт нам деньги, если мы только и делаем, что крутимся?",
        "Будь оно все проклято, ведь я ничего не могу придумать, кроме этих его слов: СЧАСТЬЕ ДЛЯ ВСЕХ, ДАРОМ, И ПУСТЬ НИКТО НЕ УЙДЕТ ОБИЖЕННЫЙ!"
    ],

    ["Юрий Никулин","http://fit4brain.com/2416",
        "Даже после небольшой улыбки в организме обязательно дохнет один маленький микроб.",
        "Много доброго можно сделать, если у тебя хорошее настроение.",
        "Если каждый из нас сумеет сделать счастливым другого человека — хотя бы одного, на земле все будут счастливы.",
        "Никогда не мстите подлым людям. Просто станьте счастливыми. И они это не переживут.",
        "Порой что-то отложишь на завтра и с ужасом думаешь: а завтра — это же практически через несколько часов!",
        "Будьте самоучками, не ждите, пока вас научит жизнь.",
        "В природе ничего не пропадает, кроме исполнившихся надежд.",
        "Комедия — дело серьезное!",
        "И у нас, ребята, будут наши победы. Главное, чтобы они были не с оружием в руках.",
        "Я буду счастлив, если обо мне потом скажут: он был добрый человек. Это не значит, что я всегда добрый. Но доброта — на первом месте.",
        "Жизнь у людей отнимает страшно много времени.",
        "Слышать смех — радость. Вызвать смех — гордость для меня.",
        "Я всегда радовался, когда вызывал смех у людей. Кто смеется добрым смехом, заражает добротой и других. После такого смеха иной становится атмосфера: мы забываем многие жизненные неприятности, неудобства.",
        "Когда ты подпрыгиваешь от радости, смотри, чтобы кто-нибудь не выбил у тебя из-под ног землю.",
        "История из жизни. Гид во время экскурсии:",
        "— А сейчас мы проедем эту большую стену, и вы увидите район, где все бросили пить и курить.",
        "Мы оживились. Кинулись к окнам автобуса. Кончилась стена, и мы увидели огромное городское кладбище.",
        "В моей жизни не раз определяющую роль играл именно случай. Анализируя прошлое и раздумывая о нем, я прихожу к выводу, что он бывает только у тех, кто ищет, кто хочет, кто ждет появления этого случая и делает все от себя зависящее для того, чтобы исполнить свою мечту."
    ],

    ["Карлос Кастанеда", "http://fit4brain.com/5796",
        "Каждый идет своим путём. Но все дороги всё равно идут в никуда. Значит, весь смысл в самой дороге, как по ней идти… Если идешь с удовольствием, значит, это твоя дорога. Если тебе плохо – в любой момент можешь сойти с нее, как бы далеко ни зашел. И это будет правильно.",
        "Единственный по-настоящему мудрый советчик, который у нас есть, – это смерть. Каждый раз, когда ты чувствуешь, как это часто с тобой бывает, что всё складывается из рук вон плохо и ты на грани полного краха, повернись налево и спроси у своей смерти, так ли это. И твоя смерть ответит, что ты ошибаешься, и что кроме её прикосновения нет ничего, что действительно имело бы значение. Твоя смерть скажет: «Но я же ещё не коснулась тебя!»",
        "Бесполезно тратить всю свою жизнь на один-единственный путь, особенно, если этот путь не имеет сердца.",
        "Не объясняй слишком многого. В каждом объяснении скрывается извинение. Так что, когда ты объясняешь, почему ты не можешь делать то или другое, на самом деле ты извиняешься за свои недостатки, надеясь, что слушающие тебя будут добры и простят их.",
        "Чтобы извлечь из жизни максимум, человек должен уметь изменяться. К сожалению, человек изменяется с большим трудом, и изменения эти происходят очень медленно. Многие тратят на это годы. Самым трудным является по-настоящему захотеть измениться.",
        "Я никогда ни на кого не сержусь. Ни один человек не может сделать ничего такого, что заслуживало бы такой моей реакции. На людей сердишься, когда чувствуешь, что их поступки важны. Ничего подобного я давно не чувствую.",
        "Люди, как правило, не отдают себе отчета в том, что в любой момент могут выбросить из своей жизни всё что угодно. В любое время. Мгновенно.",
        "Ты всегда должен помнить, что путь – это только путь. Если ты чувствуешь, что тебе не следовало бы идти по нему, то не должен оставаться на нем ни при каких обстоятельствах.",
        "Ты не должен путать одиночество и уединение. Одиночество для меня понятие психологическое, душевное, уединённость же — физическое. Первое отупляет, второе — успокаивает.",
        "Поступай так, словно это сон. Действуй смело и не ищи оправданий.",
        "Если тебе не нравится то, что ты получаешь, измени то, что ты даешь.",
        "Нам требуется всё наше время и вся наша энергия, чтобы победить идиотизм в себе. Это и есть то, что имеет значение. Остальное не имеет никакой важности…",
        "Весь фокус в том, на что ориентироваться... Каждый из нас сам делает себя либо несчастным, либо сильным. Объём работы, необходимой и в первом, и во втором случае, – один и тот же.",
        "Искусство состоит в сохранении равновесия между ужасом быть человеком и чудом быть человеком.",
        "Чтобы стать человеком знания, нужно быть воином, а не ноющим ребенком. Бороться, не сдаваясь, не жалуясь, не отступая, бороться до тех пор, пока не увидишь. И всё это лишь для того, чтобы понять, что в мире нет ничего, что действительно имело бы значение.",
    ]
];

function showQuote() {
    function getRandomNum(min, max) {
        return Math.floor(Math.random() * (max - min)) + min; //исключая max!!!
    }

    var authorIndBefore = getRandomNum(0, quotes.length);
    var authorInd = getRandomNum(0, quotes.length);
    //слегка загрубил ГСЧ для предотвращения повторов
    if (authorInd == authorIndBefore) {
        authorInd = getRandomNum(0, quotes.length);
    }

    var quoteIndBefore = getRandomNum(2, quotes[authorInd].length - 2);
    var quoteInd = getRandomNum(2, quotes[authorInd].length - 2); //0 - author, 1 - link
    //слегка загрубил ГСЧ для предотвращения повторов
    if (quoteInd == quoteIndBefore) {
        quoteInd = getRandomNum(2, quotes[authorInd].length - 2);
    }


    var quote = quotes[authorInd][quoteInd] + "<br /><a href='" + quotes[authorInd][1] + "'>" + quotes[authorInd][0] + "</a><br />";

    $("#id_divQuoteText").html("<p>" + quote + "</p>");

    $("#id_twitOutBtn").attr("href", "https://twitter.com/intent/tweet?text="
    + quotes[authorInd][quoteInd].substring(0, 140 - (quotes[authorInd][0].length))
    + "&hashtags=" + quotes[authorInd][0].replace(/\s+/g, ''));

};


$(document).ready(function () {

    var quotesall = 0;

    for (var i = 0; i < quotes.length - 1; i++) {
        for (var j = 0; j < quotes[i].length; j++) {
            quotesall++;
        }
    }

    $("#id_divHeaderText").html("<br/><small>"
    + " авторов: " + quotes.length.toString()
    + " цитат: " + quotesall.toString() + "</small>");

    $("#id_getQuoteBtn").on("click", function () {
        showQuote();
    });

    showQuote();

});
